In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.arange(24).reshape((6,4)),index=dates, columns=['A','B','C','D'])
df.iloc[0,1] = np.nan
df.iloc[1,2] = np.nan

In [4]:
print(df)

             A     B     C   D
2013-01-01   0   NaN   2.0   3
2013-01-02   4   5.0   NaN   7
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

In [5]:
df.dropna(
    axis=0,     # 0: 对行进行操作; 1: 对列进行操作
    how='any'   # 'any': 只要存在 NaN 就 drop 掉; 'all': 必须全部是 NaN 才 drop 
    )

             A     B     C   D
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

In [6]:
df.fillna(value=666)  # 将 NaN 的值用其他值代替

             A      B      C   D
2013-01-01   0  666.0    2.0   3
2013-01-02   4    5.0  666.0   7
2013-01-03   8    9.0   10.0  11
2013-01-04  12   13.0   14.0  15
2013-01-05  16   17.0   18.0  19
2013-01-06  20   21.0   22.0  23

In [7]:
df.isnull()  # 判断是否有缺失数据 NaN

                A      B      C      D
2013-01-01  False   True  False  False
2013-01-02  False  False   True  False
2013-01-03  False  False  False  False
2013-01-04  False  False  False  False
2013-01-05  False  False  False  False
2013-01-06  False  False  False  False

In [8]:
np.any(df.isnull()) == True

True